college-notes/23AID201.tex
% Created 2024-07-31 Wed 08:35
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{report}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\input{preamble}
\author{Adithya Nair}
\date{\today}
\title{Modelling, Simulation And Analysis.}
\hypersetup{
 pdfauthor={Adithya Nair},
 pdftitle={Modelling, Simulation And Analysis.},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.8)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\part{Course Overview}
\label{course-overview}
\begin{enumerate}
\item Introduction to Modelling

\item Bond graph modelling

\item Basic System Models
\end{enumerate}
\part{Unit 1}
\label{sec:org881ffdb}
This is a precursor to the real class.

An example of the use of modelling, in a somewhat humourous approach is
through the use of a girl and boy's love story.

Let's take two functions \(G(t)\) and \(B(t)\). These functions output
the 'feelings' of the girl and the boy.

Then, \[\begin{aligned}
    \frac{dG(t)}{dt} = cG(t) + dB(t) \\
    \frac{dB(t)}{dt} = aB(t) \pm bG(t) \\
\end{aligned}\] These constants represent some influence on the change
in the feelings due to the current feelings you and your significant
other can have.

Here's another example:

Model chocolate consumption and the way it leads to happiness. State the
variables: \[\begin{aligned}
    C(t) - \text{Chocolates consumed at a given day}\\
    H(t) - \text{Happiness on a given day}
\end{aligned}\] The model for these would work like this.
\[\begin{aligned}
    \frac{dC(t)}{dt} = \alpha C(t) + \beta H(t) \\
    \frac{dH(t)}{dt} = \delta C(t) + \gamma H(t) \\
\end{aligned}\] The amount of chocolate depends on our happiness as well
as the chocolates already consumed.
\chapter{Introduction to Modelling}
\label{sec:orge45cbf0}
\section{Terminology}
\label{sec:orgd4247d7}
\begin{enumerate}
\item \textbf{Modelling} - Refers to the development of a mathematical
representation of a system.

\item \textbf{Simulation} - Refers to the procedure of solving the equations that
result from model development.

\item \textbf{Mechanics} - Study of the physics of moving and static objects

\item \textbf{Dynamics} - Study of moving objects
\end{enumerate}

The steps in the design of dynamic systems involve:

\begin{itemize}
\item A physical system, which is represented using an engineering model

\item The engineering model, is represented using a bond graph technique,
block diagrams or classical method.

\item This model is then represented using differential equations

\item The equations are solved using simulation software.
\end{itemize}

This course is mainly going to use the bond graph technique.
\section{System}
\label{system}
A system is an aggregation or assemblage of objects joined in some
regular interaction or interdependence. This definition holds good for
static systems, and our course focuses on dynamic systems. Systems
consist of objects, with certain defined properties. These properties
lead to interactions which causes a change in the system. Such objecsts
of interest are known as entities, the properties of these entities are
known as attributes, process that causes dchange in the system are known
as activities and the complete decscription of entities attributes
activities is known as the state.

The environment containing the system and surrounding it is known as the
system environment. Endogenous decribes activities occuring inside the
system. Exogeneous describes activities in the invironment that affect
the system.

A closed system is a system with no exogeneous activity. An open system
is a system with exogeneous activites. If the outcomes are predictable,
it's deterministic. If they are random and vary with a set probability,
they are said to be stochastic. If the outcomes are smooth, then it's
said to be continuous. If the outcomes are discontinuous, then it's said
to be discrete.
\section{Types Of Models}
\label{types-of-models}
\begin{enumerate}
\item Static Models
\label{static-models}
Static models represents a system at a point where it is in balance,
time is not a factor. They include economic equilibrium models, they can
be used to determine the price and quanityt in markets at a single point
in time, when supply equals demand. They can be used in things like
stress-strain analysis due to time independent changes.
\item Dynamic Models
\label{dynamic-models}
Static models represents a system at a point where it is not in balance,
time is a factor. These include:

\begin{enumerate}
\item Epidemic models

\item Climate models

\item Control Systems Models

\item Population Dynamics
\end{enumerate}

The categorization is:

\begin{itemize}
\item Physical

\begin{itemize}
\item Static - Architectural models, scale models of buildings used in
architecture to test design

\item Dynamic - Models of human organs used in education
\end{itemize}

\item Mathematical

\begin{itemize}
\item Static

\begin{itemize}
\item Numerical - Linear programming, static finite element analysis

\item Analytical - Closed form solutions, economic equilibrium
\end{itemize}

\item Dynamic

\begin{itemize}
\item Numerical - Numerical Integration of differential equations, time
stepping methods for fluid dynamics.
\end{itemize}
\end{itemize}
\end{itemize}
\end{enumerate}
\section{Steps Of Analytical Modelling}
\label{steps-of-analytical-modelling}
You start with:

\begin{enumerate}
\item Purpose of the model

\begin{itemize}
\item Model to be developed should be decided based on intended
objective.
\end{itemize}

\item Define boundaries

\begin{itemize}
\item System is separated from the rest of the world, by a boundary.

\item Boundary may be real or imaginary.

\item Boundaries should be defined based on purpose.
\end{itemize}

\item Postulate a structure

\begin{itemize}
\item Systems store, dissipate, transfer or transform energy from one
form to another.

\item Identify simple elements which characterize these operations on
energy.

\item Model elements generally have two ports, sometimes more.

\item Represent the actual system as an interconnection of these
elements.

\item Referred to as physical modelling.
\end{itemize}

\item Select variables of interest

\begin{itemize}
\item First step

\item Assign variabls to all system attributes of interest like current,
velocity, temperature etc.
\end{itemize}

\item Math description of each model element

\begin{itemize}
\item Identify the relations between variables.

\item Relations may be differential ro algebraic expressions.
\end{itemize}

\item Apply relevant physical laws.

\begin{itemize}
\item The most important step.

\item Develop equations to describe the effects.

\item Physical laws describe these effects.
\end{itemize}

\item Final form of mathematical model

\begin{itemize}
\item All the equations form the final mathematical model of the system.
\end{itemize}

\item Analyse and validate model

\begin{itemize}
\item Model is never a exact representation.

\item Verify accuracy

\item Compare results with actual results.
\end{itemize}

\item Modify model if necessary.

\begin{itemize}
\item To be done if results are not convincing
\end{itemize}
\end{enumerate}

Project note - Search Varun Kumar R S, Naveen Kumar R. Go through their
papers.
\end{document}
